<!-- terraform cdk action for options with hash 05c59f07d46cb8f0c17f379bf48cdba4 -->
### ✅ Successfully planned Terraform CDK Stack 'stack'



<details><summary>Show Plan</summary>

```shell
npm warn deprecated inflight@1.0.6: This module is not supported, and leaks memory. Do not use it. Check out lru-cache if you want a good and tested way to coalesce async requests by a key value, which is much more comprehensive and powerful.
npm warn deprecated glob@7.2.3: Glob versions prior to v9 are no longer supported
npm warn deprecated glob@7.2.3: Glob versions prior to v9 are no longer supported
npm warn deprecated glob@7.2.3: Glob versions prior to v9 are no longer supported
[2025-01-06T04:50:44.090] [ERROR] default - go: downloading github.com/cdktf/cdktf-provider-local-go/local/v10 v10.1.1

[2025-01-06T04:50:44.095] [ERROR] default - go: downloading github.com/aws/jsii-runtime-go v1.106.0
go: downloading github.com/aws/constructs-go/constructs/v10 v10.3.0

[2025-01-06T04:50:44.190] [ERROR] default - go: downloading github.com/hashicorp/terraform-cdk-go/cdktf v0.20.10

[2025-01-06T04:50:44.400] [ERROR] default - go: downloading github.com/Masterminds/semver/v3 v3.3.1

stack  Initializing the backend...
stack  Successfully configured the backend "local"! Terraform will automatically
       use this backend unless the backend configuration changes.
stack  Initializing provider plugins...
       - Finding hashicorp/local versions matching "2.5.2"...
stack  - Installing hashicorp/local v2.5.2...
stack  - Installed hashicorp/local v2.5.2 (signed by HashiCorp)
       Terraform has created a lock file .terraform.lock.hcl to record the provider
       selections it made above. Include this file in your version control repository
       so that Terraform can guarantee to make the same selections by default when
       you run "terraform init" in the future.
stack  Terraform has been successfully initialized!

       You may now begin working with Terraform. Try running "terraform plan" to see
       any changes that are required for your infrastructure. All Terraform commands
       should now work.

       If you ever set or change modules or backend configuration for Terraform,
       rerun this command to reinitialize your working directory. If you forget, other
       commands will detect it and remind you to do so if necessary.
stack  - Fetching hashicorp/local 2.5.2 for linux_amd64...
stack  - Retrieved hashicorp/local 2.5.2 for linux_amd64 (signed by HashiCorp)
       - Obtained hashicorp/local checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
stack  Success! Terraform has validated the lock file and found no need for changes.
stack  Terraform used the selected providers to generate the following execution
       plan. Resource actions are indicated with the following symbols:
         + create

       Terraform will perform the following actions:
stack  # local_file.file (file) will be created
         + resource "local_file" "file" {
             + content              = "Hello, World!"
             + content_base64sha256 = (known after apply)
             + content_base64sha512 = (known after apply)
             + content_md5          = (known after apply)
             + content_sha1         = (known after apply)
             + content_sha256       = (known after apply)
             + content_sha512       = (known after apply)
             + directory_permission = "0777"
             + file_permission      = "0777"
             + filename             = "hello.txt"
             + id                   = (known after apply)
           }

       Plan: 1 to add, 0 to change, 0 to destroy.

       Changes to Outputs:
         + filename = "hello.txt"

       ─────────────────────────────────────────────────────────────────────────────

       Saved the plan to: plan

       To perform exactly these actions, run the following command to apply:
           terraform apply "plan"


```

</details>